app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @song = Song.new
    if params[:artist_id]
      @artist=Artist.find_by(id: params[:artist_id])

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]
---
  def create
    @song = Song.new(song_params)
    if params[:artist_id]
      @artist=Artist.find_by(id: params[:artist_id])
      if @artist==nil
        redirect_to artists_path
      end
      @song.artist=@artist
    end

    if @song.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id]
      @artist=Artist.find_by(id: params[:artist_id])
      if @artist==nil
        redirect_to artists_path
      end
      if not Song.find_by(id: params[:id])